{
    "header": [
        "I’ve been coding since 2017. Currently, I’m pursuing Bachelors in Computer Engineering. Also, I’m interning at NavGurukul. In this journey, I’ve used many programming languages such as Java, JavaScript, Python and getting around with TypeScript lately."
    ],

    "experience": [
        {
            "company": "NavGurukul",
            "role": "Frontend Engineer Intern",
            "duration": "Since July 2022",
            "description": "I work on the product Meraki, which provides resources to learn programming, Spoken English, etc., to 20000+ students. I primarily work with React and Material UI. I've worked on various features and enhancements of the application, such as the chat feature, which connects students with their mentors and peers, and learning tracks on which students get articles, tutorials, and quizzes.",
            "techStack": "React.js, Material UI",
            "url": "https://www.navgurukul.org/"
        },
        {
            "company": "Bitsmith Technologies",
            "role": "Software Engineer Intern",
            "duration": "Jan 2022 - Mar 2022",
            "description": "I worked on a flagship product of the company Bitsmith Classroom, an institute management application. Joined as an intern, I contributed to both the backend and frontend of the app. I implemented the integration of Google Calendar API and Razorpay Integration using SDK. Also, I developed tables using Tabler React to show students' data.",
            "techStack": "React.js, Node.js, Express.js, MongoDB",
            "url": "https://bitsmith.tech/"
        }
    ],

    "projects": {
        "text": "Projects are a great way to apply all our learnings. Here are the ones that I have created.",
        "list": [
            {
                "name": "Voicey",
                "description": "This voice chat application allows users to create rooms and join them. This has been built on peer-to-peer technology. Also, it has an OTP-based authentication. And the idea is inspired by Clubhouse.",
                "techStack": "React.js, Redux, Express.js, MongoDB, WebRTC, Socket.io",
                "links": [
                    {
                        "name": "GitHub",
                        "svg": "GitHub",
                        "url": "https://github.com/itsomkathe/Voicey"
                    }
                ]
            },
            {
                "name": "Snapsprout",
                "description": "This social media application has all the features, such as uploading pictures, liking, commenting, searching, and much more. The UI seems to be seen someplace, though :-)",
                "techStack": "React.js, Express.js, MongoDB, Lottie Animation",
                "links": [
                    {
                        "name": "GitHub",
                        "svg": "GitHub",
                        "url": "https://github.com/itsomkathe/snapsprout"
                    },
                    {
                        "name": "Live",
                        "svg": "Eye",
                        "url": "https://snapsprout.herokuapp.com/"
                    }
                ]
            }
        ]
    },

    "codingProfiles": "I like solving problems related to DSA. Here are some of my profiles."

}
